#ifndef __LED_H
#define __LED_H	 
#include "sys.h"



//////////////////////////////////////////////////////////////////////////////////	 
//********************************************************************************

//LED驱动代码	 

//STM32F103工程模板-库函数版本
//DevEBox  大越创新

//淘宝店铺：mcudev.taobao.com
//淘宝店铺：devebox.taobao.com	


//LED_D1 --  电源指示灯--供电正亮
//LED_D2 --  PA1	 --低电平点亮   


//********************************************************************************							  
////////////////////////////////////////////////////////////////////////////////// 



#define LED2 PAout(1)// LED_D2 --  PA1	 --低电平点亮  


#define LED_D2_toggle   GPIO_WriteBit(GPIOA, GPIO_Pin_1,(BitAction)(1-GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_1)))  //LED显示状态翻转


void LED_Init(void);//初始化

		 				    
#endif






































//********************************************************************************

//LED驱动代码	 

//STM32F103工程模板-库函数版本
//DevEBox  大越创新

//淘宝店铺：mcudev.taobao.com
//淘宝店铺：devebox.taobao.com	

//********************************************************************************	












