

#ifndef __EXTI_H
#define __EXIT_H	 

#include "sys.h"

/////////////////////////////////淘宝店铺：mcudev.taobao.com///////////////////////////////////////////////////	 

//外部中断 驱动代码	   

// K1  -- PA0        K1   按键 --按下后，高电平  
// K2  -- PC13       K2   按键 --按下后，低电平   

//STM32F103工程模板-库函数版本
//DevEBox  大越创新

//淘宝店铺：mcudev.taobao.com
//淘宝店铺：devebox.taobao.com			


///////////////////////////////淘宝店铺：devebox.taobao.com		/////////////////////////////////////////////////////   

void EXTIX_Init(void);//外部中断初始化		 					    
#endif



















/////////////////////////////////淘宝店铺：mcudev.taobao.com///////////////////////////////////////////////////	 

//外部中断 驱动代码	   

// K1  -- PA0        K1   按键 --按下后，高电平  
// K2  -- PC13       K2   按键 --按下后，低电平   

//STM32F103工程模板-库函数版本
//DevEBox  大越创新

//淘宝店铺：mcudev.taobao.com
//淘宝店铺：devebox.taobao.com			


///////////////////////////////淘宝店铺：devebox.taobao.com		/////////////////////////////////////////////////////  














